Revit 2026 API

# PointCloudFilterFactory Class

---

A factory class for creating point cloud filters.

SystemObject Autodesk.Revit.DB.PointCloudsPointCloudFilterFactory

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PointCloudFilterFactory
```
```vb
Public NotInheritable Class PointCloudFilterFactory
```
```cpp
public ref class PointCloudFilterFactory abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PointCloudFilterFactory = class end
```

The PointCloudFilterFactory type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateMultiPlaneFilter(IListPlane) |  |
|  | CreateMultiPlaneFilter(IListPlane, Int32) |  |

#### Reference

Autodesk.Revit.DB.PointClouds Namespace